app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2010-01-12 22:40:05', 'Hey you', 'This is a post', '2010-01-12 22:40:05')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
UPDATE `posts` SET `updated_at` = '2010-01-13 00:16:34', `title` = 'What Makes a Good Programmer?', `body` = 'There\'s a good article on \"What Makes a Good Programmer?\"(http://www.techfounder.net/2009/07/22/what-makes-a-good-programmer/) on TechFounder. In it, it includes Joel Spolsky\'s criterion for who you want to hire, which is:\r\n\r\n In principle, it’s simple. You’re looking for people who are\r\n\r\n 1. Smart, and\r\n 2. Get things done.\r\n Joel Spolsky\r\n\r\nGo read the whole article, it\'s chock full of nice things for you to consider.\r\n\r\nI was put onto this article via Akita(https://twitter.com/AkitaOnRails/status/2800088333). ' WHERE `id` = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])